#Напишите программу, которая считывает два целых числа A и B и выводит наибольшее значение из них
#Решается через степень нуля
#a = int(input())
#b = int(input())
a = 5
b = 8
print(a // b)
print(b // a)
print(a % b)
print(b % a)
print(0 ** 1)
print(0 ** 0)
print(0 ** (a // b))
print(0 ** (b // a))
